src/conf/InformationRegisters/уп_ГрафикРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>уп_ГрафикРаботы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Процедуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/conf/InformationRegisters/ГрафикиРаботыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаГрафика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/conf/Enums/уп_СостоянияГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>уп_СостоянияГрафика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/conf/InformationRegisters/уп_ГрафикРаботы/Ext/ManagerModule.bsl
Функция ПолучитьДанныеЗаПериод(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос();
	ЗАпрос.Текст = "ВЫБРАТЬ
	               |	уп_ГрафикРаботы.Сотрудник,
	               |	уп_ГрафикРаботы.Клиент,
	               |	уп_ГрафикРаботы.Помещение,
	               |	уп_ГрафикРаботы.ВремяНачала,
	               |	уп_ГрафикРаботы.Процедура,
	               |	уп_ГрафикРаботы.ВремяОкончания,
	               |	уп_ГрафикРаботы.Состояние
	               |ИЗ
	               |	РегистрСведений.уп_ГрафикРаботы КАК уп_ГрафикРаботы
	               |ГДЕ
	               |	уп_ГрафикРаботы.Период МЕЖДУ &НачалоПериода И &КонецПериода";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьСвободныхСотрудниковНаПериод (НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГрафикиРаботыСотрудников.Сотрудник
	               |ИЗ
	               |	РегистрСведений.ГрафикиРаботыСотрудников КАК ГрафикиРаботыСотрудников,
	               |	(ВЫБРАТЬ
	               |		уп_ГрафикРаботы.Сотрудник КАК Сотрудник
	               |	ИЗ
	               |		РегистрСведений.уп_ГрафикРаботы КАК уп_ГрафикРаботы
	               |	ГДЕ
	               |		уп_ГрафикРаботы.Период = НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)
	               |		И (уп_ГрафикРаботы.ВремяНачала >= &КонецПериода
	               |				ИЛИ уп_ГрафикРаботы.ВремяОкончания <= &НачалоПериода)) КАК ВложенныйЗапрос
	               |ГДЕ
	               |	ГрафикиРаботыСотрудников.ВремяНачала <= &НачалоПериода
	               |	И ГрафикиРаботыСотрудников.ВремяОкончания >= &КонецПериода
	               |	И НАЧАЛОПЕРИОДА(ГрафикиРаботыСотрудников.ВремяНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&НачалоПериода, ДЕНЬ)";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудник");
КонецФункции

Функция ЗакрытьЗаписьГрафика(Сотрудник, Клиент, Помещение, ВремяНачала) Экспорт
	НаборЗаписейГрафика = РегистрыСведений.уп_ГрафикРаботы.СоздатьНаборЗаписей();
	НаборЗаписейГрафика.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписейГрафика.Отбор.Клиент.Установить(Клиент);
	НаборЗаписейГрафика.Отбор.Помещение.Установить(Помещение);
	НаборЗаписейГрафика.Отбор.ВремяНачала.Установить(ВремяНачала);
	НаборЗаписейГрафика.Прочитать();
	Если НаборЗаписейГрафика.Количество() > 0 Тогда
		Для Каждого ЗаписьГрафика Из НаборЗаписейГрафика Цикл
			Если ЗаписьГрафика.Состояние <> Перечисления.уп_СостоянияГрафика.Закрыт Тогда
				ЗаписьГрафика.Состояние = Перечисления.уп_СостоянияГрафика.Закрыт;
				НаборЗаписейГрафика.Записать(Истина);
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция ОткрытьЗаписьГрафика(Сотрудник, Клиент, Помещение, ВремяНачала) Экспорт
	НаборЗаписейГрафика = РегистрыСведений.уп_ГрафикРаботы.СоздатьНаборЗаписей();
	НаборЗаписейГрафика.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписейГрафика.Отбор.Клиент.Установить(Клиент);
	НаборЗаписейГрафика.Отбор.Помещение.Установить(Помещение);
	НаборЗаписейГрафика.Отбор.ВремяНачала.Установить(ВремяНачала);
	НаборЗаписейГрафика.Прочитать();
	Если НаборЗаписейГрафика.Количество() > 0 Тогда
		Для Каждого ЗаписьГрафика Из НаборЗаписейГрафика Цикл
			Если ЗаписьГрафика.Состояние = Перечисления.уп_СостоянияГрафика.Закрыт Тогда
				ЗаписьГрафика.Состояние = Перечисления.уп_СостоянияГрафика.Автоматический;
				НаборЗаписейГрафика.Записать(Истина);
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции
